app/Views/partials/sidebar.php

SELECT *
FROM `menus`
ORDER BY `number` ASC, `id` ASC
---
  <ul class="nav nav-pills nav-sidebar flex-column" data-widget="treeview" role="menu" data-accordion="false">
    <?php
    $group_id=auth()->user()->group_id;
    $menus=$db->table('menus')->orderBy('number,id', 'ASC')->get();