app/Helpers/MY_combobox_helper.php

SELECT *
FROM `departments`
WHERE `active` = 1
ORDER BY `name` ASC
---
    function easyui_department($option){
        $db = db_connect();
        $w="";
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        $attribute.=isset($option['multiple'])?' multiple="true"':'';
        $attribute.=isset($option['multiline'])?' multiline="true"':'';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';
        $query=null;
        if(isset($option['master'])){
            $query=$db->table('departments')->orderBy('name','ASC')->getWhere(['active'=>1,'parent_id'=>0]);
        }else{
            $query=$db->table('departments')->orderBy('name','ASC')->getWhere(['active'=>1]);

SELECT *
FROM `grades`
WHERE `active` = 1
ORDER BY `id` ASC
---
    function easyui_grade($option){
        $db = db_connect();
        $w="";
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        $attribute.=isset($option['multiple'])?' multiple="true"':'';
        $attribute.=isset($option['multiline'])?' multiline="true"':'';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';

        $query=$db->table('grades')->orderBy('id','ASC')->getWhere(['active'=>1]);

SELECT *
FROM `jobtitles`
WHERE `active` = 1
ORDER BY `report_level` DESC
---
    function easyui_jobtitle($option){
        $db = db_connect();
        $w="";
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        $attribute.=isset($option['multiple'])?' multiple="true"':'';
        $attribute.=isset($option['multiline'])?' multiline="true"':'';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';

        $query=$db->table('jobtitles')->orderBy('report_level','DESC')->getWhere(['active'=>1]);

SELECT *
FROM `branchs`
WHERE `active` = 1
ORDER BY `name` ASC
---
    function easyui_branch($option){
        $db = db_connect();
        $w="";
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        $attribute.=isset($option['multiple'])?' multiple="true"':'';
        $attribute.=isset($option['multiline'])?' multiline="true"':'';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';
        $query=$db->table('branchs')->orderBy('name','ASC')->getWhere(['active'=>1]);

SELECT *
FROM `projects`
WHERE `active` = 1
ORDER BY `name` ASC
---
    function easyui_project($option){
        $db = db_connect();
        $w="";
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        $attribute.=isset($option['multiple'])?' multiple="true"':'';
        $attribute.=isset($option['multiline'])?' multiline="true"':'';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';
        $query=$db->table('projects')->orderBy('name','ASC')->getWhere(['active'=>1]);

SELECT *
FROM `employmentstatuses`
WHERE `active` = 1
ORDER BY `label` ASC
---
    function easyui_employment_status($option){
        $db = db_connect();
        $w="";
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        $attribute.=isset($option['multiple'])?' multiple="true"':'';
        $attribute.=isset($option['multiline'])?' multiline="true"':'';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';

        $query=$db->table('employmentstatuses')->orderBy('label','ASC')->getWhere(['active'=>1]);